Course Work/w4d3/ninety_nine_cats_ii/app/views/cats/_req_tr.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  <td><%= req.end_date %></td>
  <td><%= User.find(req.user_id).user_name %></td>

SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 2]]
---
    <% if req.pending? %>
      <% if Cat.find(req.cat_id).user_id == current_user.id %>