Course Work/w4d3/ninety_nine_cats_ii/app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "session_token", "user_name") VALUES ($1, $2, $3) RETURNING "id"  [["password_digest", "$2a$10$B/SDMTk.htq6kroe.QEOBuTUOJswpb8aqlGj8KtIgpyXxOnXcDTYq"], ["session_token", "km_yA1deIN3w9s0uDdgcjA"], ["user_name", "Lu"]]
---
  def create
    @user = User.new(user_params)
    if @user.save